WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
/****************************************************************************
 * hcom_nx_config_manager.c
 *
 *   Copyright (C) 2021 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

//  The methods and data structures in this file provide access to the
//  configuration of the meadow board.
#include <nuttx/config.h>

#include <arpa/inet.h>
#include <ctype.h>
#include <strings.h>
#include <time.h>
#include <nuttx/semaphore.h>
#include <nuttx/kstring.h>

#include "hcom_nx_common.h"
#include <meadow/hcom_upd_shared.h>
#include <meadow/hcom_nuttx_shared.h>
#include <meadow/meadow_hw_version.h>
#include "../espcp/espcp_coprocessor.h"
#include "../espcp/espcp_message_dispatcher.h"
#include "../espcp/espcp_shared_enums.h"
#include "stm32_uid.h" // stm32_get_uniqueid()

#include "hcom_nx_common.h"

#include "hcom_nx_config_manager.h"
#include "../libcyaml/cyaml.h"


/****************************************************************************
 * Uncomment the #define below to turn on debug help macros.
 ****************************************************************************/
// #define USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/**
 *  @brief Default entry in the network_interfaces array to be used if no interface
 *         is selected in the config file.
 */
#define MEADOW_DEFAULT_NETWORK_INTERFACE    0

/**
 * @brief String used for version numbers when the value is not available.
 */
#define UNKNOWN_VERSION_STRING              "Not available"

/****************************************************************************
 * Local type defintions.
 ****************************************************************************/

/****************************************************************************
 * Private Data
 ****************************************************************************/

/**
 *  Local variable to hold a pointer to the configuration.
 */
static meadow_configuration_t *meadow_configuration = NULL;

/**
 *  Definitions of the interface information locations in the network_interfaces array.
 */
#define MEADOW_INTERFACE_INFORMATION_WIFI       0
#define MEADOW_INTERFACE_INFORMATION_ETHERNET   1

/**
 *  @brief Array of network interfaces available.
 */
static meadow_network_interface_t network_interfaces[] = 
{
    {
        .interface_type = MEADOW_IFT_ESP32,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0
    },
    {
        .interface_type = MEADOW_IFT_ETHERNET,
        .use_dhcp = 1,
        .ip_address = 0,
        .netmask = 0,
        .gateway = 0
    }
};

/**
 *  Mutex to be used by any code that wants access to the configuration.
 */
static sem_t config_lock = { };

/**
 *  Configuration for the CYAML library.
 */
static const cyaml_config_t cyaml_config =
{
	.log_level = CYAML_LOG_WARNING, /* Logging errors and warnings only. */
	.log_fn = cyaml_log,            /* Use the default logging function. */
	.mem_fn = cyaml_mem,            /* Use the default memory allocator. */
    .flags = CYAML_CFG_IGNORE_UNKNOWN_KEYS | CYAML_CFG_CASE_INSENSITIVE
};

/**
 *  Schema for string pointer values (used in sequences of strings).
 * 
 *  This is used in the DNS and NTP server sequences. 
 */
static const cyaml_schema_value_t string_ptr_schema =
{
	CYAML_VALUE_STRING(CYAML_FLAG_POINTER, char, 0, CYAML_UNLIMITED),
};

/**
 *  Device configuration options from the YAML file.
 */
struct yaml_device_s
{
    /**
     *  @brief Name of the device.
     */
    char *name;

    /**
     *  @brief Should the system reboot if the .NET application encounter an unhandled exception?
     */
    char *reboot_on_unhandled_exceptions;

    /**
     *  @brief Maximum amount of time the initialisation method in the .NET application can run
     *         before it is assumed to have failed.
     */
    char *initialisation_timeout_seconds;

    /**
     * @brief Does the system have SD card hardware installed (CCM).
     */
    char *sd_storage_supported;
};
typedef struct yaml_device_s yaml_device_t;

/**
 *  Defintion of the fields in the yaml_device_s structure.
 *
 *  This is an array of the field definitions.
 */
static const cyaml_schema_field_t configuration_device_section_schema[] =
{
    CYAML_FIELD_STRING_PTR("Name", CYAML_FLAG_POINTER | CYAML_FLAG_OPTIONAL, yaml_device_t, name, 0, CYAML_UNLIMITED),
    CYAML_FIELD_STRING_PTR("InitializationTimeoutSeconds", CYAML_FLAG_POINTER | CYAML_FLAG_OPTIONAL, yaml_device_t, initialisation_timeout_seconds, 0, CYAML_UNLIMITED),
    CYAML_FIELD_STRING_PTR("RebootOnUnhandledException", CYAML_FLAG_POINTER | CYAML_FLAG_OPTIONAL, yaml_device_t, reboot_on_unhandled_exceptions, 0, CYAML_UNLIMITED),
    CYAML_FIELD_STRING_PTR("SdStorageSupported", CYAML_FLAG_POINTER | CYAML_FLAG_OPTIONAL, yaml_device_t, sd_storage_supported, 0, CYAML_UNLIMITED),
	CYAML_FIELD_END
    
