WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
#if defined(USE_MEADOW_DEBUG_HELPERS)
    MEADOW_TRACE_INFORMATION("Using %s configuration\n", (meadow_configuration->using_default_configuration == 1) ? "default" : "user");
    MEADOW_TRACE_INFORMATION("Device Information:\n");
    MEADOW_TRACE_INFORMATION("    Device name: %s\n", meadow_configuration->device_name);
    MEADOW_TRACE_INFORMATION("    Reboot on unhandled exception: %d\n", meadow_configuration->reboot_on_unhandled_exceptions);
    MEADOW_TRACE_INFORMATION("    Initialisation timeout: %d seconds\n", meadow_configuration->initialisation_timeout_seconds);
    MEADOW_TRACE_INFORMATION("    SD storage enabled: %d\n", meadow_configuration->sd_storage_supported);
    MEADOW_TRACE_INFORMATION("Mono Control:\n");
    MEADOW_TRACE_INFORMATION("    Options: %s\n", (meadow_configuration->mono_options == NULL) ? "None configured" : meadow_configuration->mono_options);
    MEADOW_TRACE_INFORMATION("Coprocessor:\n");
    MEADOW_TRACE_INFORMATION("    SPI speed: %d Hz\n", meadow_configuration->esp_spi_speed_hz);
    MEADOW_TRACE_INFORMATION("    Automatically start network: %d\n", meadow_configuration->automatically_start_network);
    MEADOW_TRACE_INFORMATION("    Automatically reconnect: %d\n", meadow_configuration->automatically_reconnect);
    MEADOW_TRACE_INFORMATION("    Maximum retry count: %d\n", meadow_configuration->maximum_retry_count);
    char address[INET_ADDRSTRLEN];
    MEADOW_TRACE_INFORMATION("Network:\n");
    MEADOW_TRACE_INFORMATION("    Ethernet:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_ETHERNET].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    WiFi:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_INTERFACE_INFORMATION_WIFI].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    Get network time at startup: %d\n", meadow_configuration->get_network_time_at_startup);
    MEADOW_TRACE_INFORMATION("    NTP refresh period: %d seconds\n", meadow_configuration->ntp_refresh_period_seconds);
    MEADOW_TRACE_INFORMATION("    NTP Servers (%d):\n", meadow_configuration->ntp_servers_count);
    int index = 0;
    for (index = 0; index < meadow_configuration->ntp_servers_count; index++)
    {
        inet_ntop(AF_INET, &meadow_configuration->ntp_servers[index], address, INET_ADDRSTRLEN);
        MEADOW_TRACE_INFORMATION("        - %s\n", address);
    }
    MEADOW_TRACE_INFORMATION("    DNS Servers:\n");
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "rb");
    char buffer[32];
    while (fgets(buffer, 32, dns_file) != NULL)
    {
        MEADOW_TRACE_INFORMATION("        - %s", (buffer + 11));
    }
    fclose(dns_file);
    MEADOW_TRACE_INFORMATION("Internal Debug:\n");
    MEADOW_TRACE_INFORMATION("    Use UART for trace: %d\n", meadow_configuration->use_uart1_for_trace);
    MEADOW_TRACE_INFORMATION("    Trace level: %d\n", meadow_configuration->trace_level);
    MEADOW_TRACE_INFORMATION("    Debugger attached to ESP32: %d\n", (meadow_configuration->reset_esp32_at_startup == 1) ? 0 : 1);
#endif

    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_config_copy_string
 *
 * Description:
 *  Copy a string into the buffer and return the amount of storage used to
 *  store the string and its terminating 0.
 *
 * Input Parameters:
 *  source - String to be copied.
 *  destination - Memory to hold the copy of the string.
 *
 * Returned Value:
 *  Amount of memory consumed by the string and its terminating 0.
 *
 * Assumptions/Limitations:
 *  The destination buffer is large enough to hold tha copy of the string.
 *
 ****************************************************************************/
int hcom_nx_config_copy_string(char *source, char *destination)
{
    int length = 0;

    if (source == NULL)
    {
        *destination = 0;
    }
    else
    {
        length = strlen(source);
        strcpy(destination, source);
    }

    return(length + 1);
}

/****************************************************************************
 * Name: hcom_nx_config_version_string_storage_used
 *
 * Description:
 *  Calculate the amount of storage used to store the string interpretation
 *  of a version information object.
 *
 * Input Parameters:
 *  version - Pointer to a meadow_version_number_t object.
 *
 * Returned Value:
 *  Amount of storage required.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_version_string_storage_used(meadow_version_number_t *version)
{
    int storage_required = 0;

    if (version != NULL)
    {
        if (version->branch_name != NULL)
        {
            storage_required += strlen(version->branch_name) + 1;
        }
        if (version->short_string != NULL)
        {
            storage_required += strlen(version->short_string) + 1;
        }
        if (version->long_string != NULL)
        {
            storage_required += strlen(version->long_string) + 1;
        }
    }

    return(storage_required);
}

/****************************************************************************
 * Name: hcom_nx_config_copy_for_user_mode
 *
 * Description:
 *  Copy the configuration data into the specified location along with copies
 *  of any strings.
 *
 * Input Parameters:
 *  buffer - area of memory to hold the copy of the data in the configuration
 *           structure plus the string.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_copy_for_user_mode(uint8_t *buffer, int length)
{
    if (buffer == NULL)
    {
        return ERROR;
    }

    int result = OK;
    hcom_nx_config_lock();

