WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    meadow_configuration_t *config = hcom_nx_config_get_pointer();
    int storage_required = sizeof(meadow_configuration_t);
    if (config->device_name != NULL)
    {
        storage_required += strlen(config->device_name) + 1;
    }
    if (config->hardware_version_text != NULL)
    {
        storage_required += strlen(config->hardware_version_text) + 1;
    }
    if (config->mono_options != NULL)
    {
        storage_required += strlen(config->mono_options) + 1;
    }
    storage_required += hcom_nx_config_version_string_storage_used(&config->os_version);
    storage_required += hcom_nx_config_version_string_storage_used(&config->mono_version);
    storage_required += hcom_nx_config_version_string_storage_used(&config->esp_version);

    storage_required += sizeof(config->chip_id) + sizeof(config->serial_number);
    if (length < storage_required)
    {
        hcom_nx_config_unlock();
        result = ERROR;
    }
    else
    {
        memset((void *) buffer, 0, length);
        meadow_configuration_t *new_config = (meadow_configuration_t *) buffer;

        memcpy((void *) new_config, (void *) config, sizeof(meadow_configuration_t));
        //
        //  Put the strings at the end of the configuration structure.
        //
        char *ptr = (char *) (buffer + sizeof(meadow_configuration_t));
        ptr += hcom_nx_config_copy_string(config->mono_options, ptr);
        new_config->hardware_version_text = ptr;
        ptr += hcom_nx_config_copy_string(config->hardware_version_text, ptr);
        new_config->device_name = ptr;
        ptr += hcom_nx_config_copy_string(config->device_name, ptr);
        //
        //  TODO: Abstract to method.
        //
        new_config->os_version.short_string = ptr;
        ptr += hcom_nx_config_copy_string(config->os_version.short_string, ptr);
        new_config->os_version.long_string = ptr;
        ptr += hcom_nx_config_copy_string(config->os_version.long_string, ptr);
        new_config->os_version.branch_name = ptr;
        ptr += hcom_nx_config_copy_string(config->os_version.branch_name, ptr);
        //
        new_config->mono_version.short_string = ptr;
        ptr += hcom_nx_config_copy_string(config->mono_version.short_string, ptr);
        new_config->mono_version.long_string = ptr;
        ptr += hcom_nx_config_copy_string(config->mono_version.long_string, ptr);
        new_config->mono_version.branch_name = ptr;
        ptr += hcom_nx_config_copy_string(config->mono_version.branch_name, ptr);
        //
        new_config->esp_version.short_string = ptr;
        ptr += hcom_nx_config_copy_string(config->esp_version.short_string, ptr);
        new_config->esp_version.long_string = ptr;
        ptr += hcom_nx_config_copy_string(config->esp_version.long_string, ptr);
        new_config->esp_version.branch_name = ptr;
        ptr += hcom_nx_config_copy_string(config->esp_version.branch_name, ptr);
    }
    hcom_nx_config_unlock();

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint32_value
 *
 * Description:
 *  Get a uint32_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint32_value(int source, uint8_t *destination, int destination_length)
{
    if (destination_length < sizeof(uint32_t))
    {
        return(ERROR);
    }
    *((uint32_t *) destination) = source;
    return(sizeof(uint32_t));
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint8_value
 *
 * Description:
 *  Get a uint8_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint8_value(uint8_t source, uint8_t *destination, int destination_length)
{
    int result = ERROR;

    if (destination_length > 0)
    {
        *destination = source;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_string_value
 *
 * Description:
 *  Get a string configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration string to be copied.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_string_value(char *source, uint8_t *destination, int destination_length)
{
    int result = ERROR;
    
    if (source == NULL)
    {
        if ((destination != NULL) && (destination_length > 0))
        {
            *destination = 0;
            result = 0;
        }
    }
    else
    {
        if ((strlen(source) + 1) <= destination_length)
        {
            result = strlen(strcpy((char *) destination, source));
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_ip_address
 *
 * Description:
 *  Get an IP address or 0 if DHCP is enabled.
 *
 * Input Parameters:
 *  use_dhcp - use DHCP.
 *  ip_address - IP address to be used if DHCP is not enabled.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_ip_address(bool use_dhcp, uint32_t ip_address, uint8_t *destination, int destination_length)
{
    if (use_dhcp)
    {
        return(hcom_nx_config_get_uint32_value(0, destination, destination_length));
    }
    return(hcom_nx_config_get_uint32_value(ip_address, destination, destination_length));
}

/****************************************************************************
 * Name: hcom_nx_config_get_bytes
 *
 * Description:
 *  Get a byte array configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration bytes to be copied.
 *  source_length - length of the source buffer.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_bytes(uint8_t *source, int source_length, uint8_t *destination, int destination_length)
{
    int result;

    if (source_length > destination_length)
    {
        result = ERROR;
    }
    else
    {
        memcpy(destination, source, source_length);
        result = source_length;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_unique_id
 *
 * Description:
 *  get the unique ID from the config and format this into a string.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *  buffer - Buffer to hold the unique ID string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  The config object is locked and released by the caller.
 *
 ****************************************************************************/
static int hcom_nx_config_get_unique_id(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result;

    if (buffer_length > 35)
    {
        result = snprintf((char *) buffer, buffer_length, "%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x",
                    config->serial_number[0], config->serial_number[1], config->serial_number[2],
                    config->serial_number[3], config->serial_number[4], config->serial_number[5],
                    config->serial_number[6], config->serial_number[7], config->serial_number[8],
                    config->serial_number[9], config->serial_number[10], config->serial_number[11]);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_get_serial_number
 *
 * Description:
 *  get the chip serial number from the config and format this into a string.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *  buffer - Buffer to hold the serial number string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  The config object is locked and released by the caller.
 *
 ****************************************************************************/
int hcom_nx_config_get_serial_number(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result;

    if (buffer_length > 18)
    {
        result = snprintf((char *) buffer, buffer_length, "%02X%02X%02X%02X%02X%02X", config->chip_id[0], config->chip_id[1],
                            config->chip_id[2], config->chip_id[3], config->chip_id[4], config->chip_id[5]);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_maximum_retry_count
 *
 * Description:
 *  Set the MaximumRetryCount property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the MaximumRetryCount
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_maximum_retry_count(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 4)
    {
        int retryCount = *((int *) buffer);
        result = hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, retryCount);
        if (result == OK)
        {
            config->maximum_retry_count = retryCount;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_automatically_reconnect
 *
 * Description:
 *  Set the AutomaticallyReconnect property and inform the ESP of the change.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_automatically_reconnect(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, *buffer);
        if (result == OK)
        {
            config->automatically_reconnect = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_version_string
 *
 * Description:
 *  Get the version string (or string representing an unknown value).
 *
 * Input Parameters:
 *  version - Pointer to the version information.
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_version_string(meadow_version_number_t *version, uint8_t *buffer, int buffer_length)
{
    int result = 0;

    if (version->short_string == NULL)
    {
        result = hcom_nx_config_get_string_value(UNKNOWN_VERSION_STRING, buffer, buffer_length);
    }
    else
    {
        result = hcom_nx_config_get_string_value(version->short_string, buffer, buffer_length);
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_build_date
 *
 * Description:
 *  Get the OS build date.
 *
 * Input Parameters:
 *  version - Version information.
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_build_date(meadow_version_number_t *version, uint8_t *buffer, int buffer_length)
{
    int result = 0;

